release/app/controllers/models_controller.rb

  def index
    @models = Model.search(ModelSearchCriteria.build_criteria(params, current_agency)).
      order(sort_column + " " + sort_direction).paginate(:per_page => per_page, :page => params[:page])
---
SELECT "models".* FROM "models" WHERE "models"."agency_id" = 1 AND (hair_color = 'castanho_claro') ORDER BY name asc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "models" WHERE "models"."agency_id" = 1 AND (specialty like '%moda_editorial%')

  def show
    @model = current_agency.models.find_by_id(params[:id])
---
SELECT "models".* FROM "models" WHERE "models"."agency_id" = 1 AND "models"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @model = current_agency.models.find_by_id(params[:id])
---
SELECT "models".* FROM "models" WHERE "models"."agency_id" = 1 AND "models"."id" = 4 LIMIT 1

  def create
    @model = Model.new(params[:model])
    @model.agency = current_agency

    respond_to do |format|
      if @model.save
---
INSERT INTO "models" ("address", "address_number", "age", "agency_id", "avatar_photo_id", "bank", "bank_account", "bank_account_type", "bank_agency", "biotype", "birthday", "bust", "cel_phone", "cep", "city", "complement", "country", "cpf", "created_at", "ethnicity", "eyes_color", "gender", "hair_color", "height", "hip", "home_phone", "job", "job_email", "job_phone", "name", "neighborhood", "other_email", "personal_email", "responsible", "responsible_cpf", "responsible_rg", "rg", "score", "sector", "shoes", "site_url", "state", "updated_at", "waist") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @model = current_agency.models.find_by_id(params[:id])

    respond_to do |format|
      redirect_to models_path and return unless @model
      if @model.update_attributes(params[:model])
---
SELECT "models".* FROM "models" WHERE "models"."agency_id" = 1 AND "models"."id" = 1 LIMIT 1
UPDATE "models" SET "responsible" = '', "responsible_cpf" = '', "responsible_rg" = '', "eyes_color" = '', "hair_color" = '', "sector" = '', "job" = '', "rg" = '', "cpf" = '', "cel_phone" = '', "home_phone" = '', "job_phone" = '', "address" = '', "address_number" = '', "neighborhood" = '', "complement" = '', "cep" = '', "city" = '', "state" = '', "country" = '', "bank" = '', "bank_agency" = '', "bank_account" = '', "bank_account_type" = '', "personal_email" = '', "job_email" = '', "other_email" = '', "site_url" = '', "updated_at" = '2012-09-21 11:28:31.147282' WHERE "models"."id" = 1

  def destroy
    @model = current_agency.models.find_by_id(params[:id])
    @model.destroy if @model
---
SELECT "models".* FROM "models" WHERE "models"."agency_id" = 1 AND "models"."id" = 4 LIMIT 1
DELETE FROM "models" WHERE "models"."id" = ?  [["id", 2]]