release/app/controllers/photos_controller.rb

SELECT "models".* FROM "models" WHERE "models"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "photos".* FROM "photos" WHERE "photos"."model_id" = 1
---
  def index
    @photos = Model.find(params[:model_id]).photos

INSERT INTO "photos" ("created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "model_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    # @photo = Photo.new(params[:photo])

    # respond_to do |format|
    #   if @photo.save
    #     format.html { redirect_to @photo, notice: 'Photo was successfully created.' }
    #     format.json { render json: @photo, status: :created, location: @photo }
    #   else
    #     format.html { render action: "new" }
    #     format.json { render json: @photo.errors, status: :unprocessable_entity }
    #   end
    # end
    @photo = Photo.new
    @photo.image = params[:photo][:image].shift
    @photo.model_id = params[:model_id]
    if @photo.save